elbow_gambit/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall //Definido a partir da boundary 
    {
        type            zeroGradient;
    }

    inlet-1 //Definido a partir da boundary
    {
        type            zeroGradient;
    }

    inlet-2 //Definido a partir da boundary
    {
        type            zeroGradient;
    }

    outlet //Definido a partir da boundary
    {
        type            fixedValue;
        value           uniform 0;
    }

    new_wall //Definido a partir da boundary
    {
        type            empty;
    }
}

// ************************************************************************* //
